## Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [114]:
import pandas as pd

In [5]:
pd_ser = pd.Series([4, 8, 15, 16, 23, 42])
pd_ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
lst = [i for i in range(1,11)]
print(pd.Series(lst))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Create a Pandas DataFrame that contains the following data:

In [13]:
data = {"Name":["Alice","Bob","Claire"],
'Age':[25,30,27],
'Gender':['Female','Male','Female']}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, DataFrame is a two-dimensional tabular data structure that is similar to a spreadsheet or a SQL table. It consists of rows and columns, with each column having a unique label.

On the other hand, Series is a one-dimensional labeled array that can hold any data type, such as integers, floats, strings, etc.

In [113]:
df = pd.DataFrame({'name': ['John', 'Mike', 'Sara'],
    'age': [25, 30, 0],
    'city': ['New York', 'London', 'Paris']})
df

   name  age      city
0  John   25  New York
1  Mike   30    London
2  Sara    0     Paris

In [39]:
sr= pd.Series(['name ','John ', 'Mike'])
sr

0    name
1    John
2     Mike
dtype: object

## What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Following are few commonly used functions used in pandas to manipulate data.
1. df.reindex
2. df.rename
3. df.astype
4. df.replace
5. df.fillna

In [94]:
# this is our dataframe
df

   name  age      city
0  John   25  New York
1  Mike   30    London
2  Sara    0     Paris

In [93]:
#replacing paris with amsterdam using replace func
df.replace("Paris","Amsterdam" )

   name  age       city
0  John   25   New York
1  Mike   30     London
2  Sara    0  Amsterdam

In [95]:
# changing the order of existing indexs using reindex
df.reindex([2,0,1])

   name  age      city
2  Sara    0     Paris
0  John   25  New York
1  Mike   30    London

In [96]:
# changing the name of the column name to nam using rename func
df.rename(columns={"name":"nam"})

    nam  age      city
0  John   25  New York
1  Mike   30    London
2  Sara    0     Paris

In [97]:
# dtype of age is int64 and here changing it to float64 using astype
df['age'] = df['age'].astype('float64')
df.dtypes

name     object
age     float64
city     object
dtype: object

In [127]:
#importing numpy to fill 0 with NaN
import numpy as np
df.replace(0,np.nan,  inplace=True)

In [130]:
# filling NaN with numeric value 26 using fillna
df.fillna(26)

   name   age      city
0  John  25.0  New York
1  Mike  30.0    London
2  Sara  26.0     Paris